#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Author  : SUN FEIFEI


"""版权申诉 条款内容"""
complaints_content = ['版权申诉',
         '作为知识分享与传播平台服务提供商，“在线助教”网站仅为用户提供上传空间及在线分享手段。“在线助教”网站仅对用户上传内容的表现方式做保护处理，对上传内容本身不做任何修改或编辑。“在线助教”网站坚决反对任何违反中华人民共和国版权法律法规的行为。一经发现，“在线助教”网站会立即移除并停止继续传播任何盗版和非法转载以及其他侵权作品，为此我们制定了旨在保护知识产权权利人合法权益的措施和步骤。具体见下：',
         '如果阁下是某一作品的著作权人和/或依法可以行使信息网络传播权的权利人，且您认为“在线助教”网站站上用户上传内容侵犯了您对该等作品的信息网络传播权，请阁下务必以邮件的方式通知本公司。阁下应对邮件通知陈述之真实性负责。如果权利通知的陈述失实，权利通知提交者将承担对由此造成的全部法律责任（包括但不限于赔偿各种费用及律师费）。如果上述个人或单位不确定网络上可获取的资料是否侵犯了其合法权益，“在线助教”建议该个人或单位首先咨询专业人士。',
         '除明显或众所周知的作品如已经广泛传播的作品资料以外，提出侵权指控者必须提供以下资料：',
         '1.\t被控侵权信息的网页名称；',
         '2.\t被控侵权信息的网址（为了及时处理，请阁下提供作品的网络地址而不是文档名称的搜索地址）；',
         '3.\t本人的手机号码和电子邮件地址；',
         '4.\t阁下或阁下所在机构拥有版权的相关信息说明和资质证明。',
         '1)\t若涉及单位请提供贵单位营业执照复印件并加盖公章；',
         '2)\t若涉及个人的请提供身份证复印件或护照复印件；',
         '3)\t若您由律师代理，请提供对代理律师事务所的授权书。',
         '5.\t请在权利通知书中写上以下陈述：“本公司（本人）保证，本通知中所述信息是充分、真实、准确的，本公司（本人）是该投诉内容的合法权利人（合法权利授权人），有权行使该权利。由此引起的一切法律纠纷，与‘在线助教’网站无关，由我本人承担。”',
         '6.\t请将营业执照复印件、身份证复印件、授权书等材料投寄至：',
         '天津市 东丽区 空港经济区 西三道158号 金融中心5号楼1108室，邮编：300308',
         '“在线助教”客户服务部负责人 收', '微信号：wxzxzj1（在线助教）',
         '只要符合上述条件，“在线助教”网站会在收到相关材料后依法采取包括移除在内的相应措施，并告知在本站发布作品的人。如果不符合上述条件，则暂不采取包括移除等的相应的措施。',
         '“在线助教”网站对他人在网站上实施的此类侵权行为不承担侵权法律责任，侵权的法律责任概由上传人承担。在收到被侵权人的邮件并审核确认相关证据后，“在线助教”网站可以向被侵权人提供上传人的联系信息。“在线助教”网站在满足前款条件下采取移除等相应措施后，不为此向被侵权人承担违约责任或其他法律责任，也不因侵权指控不成立对网站上传人带来损害承担赔偿责任。'
         ]
