#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Author  : SUN FEIFEI

reset_data = (
    {'reset': '13020670521'},  # 原手机号
    {'reset': '18711111122'},  # 已注册其他手机号
    {'reset': '  '},  # 两个空格
    {'reset': '           '},  # 11个空格
    {'reset': ''},  # 为空
    {'reset': '1'},  # 1个数字
    {'reset': '180111111321'},  # 12位数字
    {'reset': '81011111111'},  # 11位数字 - 非手机号
    {'reset': '你好万星在线教育学生端'},  # 中文、数字、英文字符组合 -11位
    {'reset': '20182018201'},  # 数字 -11位
    {'reset': 'WEhelloDCds'},  # 大小写英文字符-11位
    {'reset': '你好2018world'},  # 中文、数字、英文字符组合 -11位
    {'reset': 'q12 a.w@S勿x'},  # 中文、数字、英文、大写字母、空格、@、'.'字符组合
    
    {'reset': '18011115234'},  # 未注册手机号
    {'reset': '13020670521'},  # 改回原手机号
    )
